NevynUK/ESP32-P4-Protected-Mode-Sample/main/kernel_main.c
#define UPMP_R      (1u << 0)
#define UPMP_W      (1u << 1)
#define UPMP_X      (1u << 2)
#define UPMP_A_TOR  (1u << 3)

static void pmp_apply(void *arg)
{
    const uint32_t iram_text_end = (uint32_t) (uintptr_t) &_iram_text_end;

    uint32_t addr[16] = { 0 };
    uint32_t cfg[4] = { 0 };
    uint8_t byte[16] = { 0 };
    int i;

    (void) arg;

    /* A TOR entry spans from the PREVIOUS entry's address to its own, so each
     * range costs two entries: one holding the base with its mode OFF, which
     * grants nothing by itself, and one carrying the limit and permissions.
     */

    /* [SOC_IRAM_LOW, _iram_text_end) -- the code U-mode executes.  Still the
     * whole of IRAM text rather than only the user's functions; narrowing it
     * needs the user's code in a section of its own.
     */

    addr[0] = SOC_IRAM_LOW >> 2;
    addr[1] = iram_text_end >> 2;
    byte[1] = UPMP_A_TOR | UPMP_R | UPMP_X;

    /* The user pool, and ONLY the user pool, out of all internal data memory.
     * This is the split.  Everything else in internal SRAM -- the kernel's
     * heap, its task stacks, its data, the slot table in TCM -- matches no
     * entry, and PMP is default-deny for U-mode, so none of it is reachable
     * from a user however wild its pointers get.
     */

    addr[2] = ((uint32_t) (uintptr_t) g_user_pool) >> 2;
    addr[3] = ((uint32_t) (uintptr_t) g_user_pool + sizeof(g_user_pool)) >> 2;
    byte[3] = UPMP_A_TOR | UPMP_R | UPMP_W;

    /* [SOC_EXTRAM_LOW, SOC_EXTRAM_HIGH) -- all 32 MB of PSRAM, where the user
     * arenas live.
     */

    addr[4] = SOC_EXTRAM_LOW >> 2;
    addr[5] = SOC_EXTRAM_HIGH >> 2;
    byte[5] = UPMP_A_TOR | UPMP_R | UPMP_W;

    /* Everything else stays OFF, so U-mode cannot reach it: the peripherals,
     * RTC RAM and ROM that IDF used to grant, and TCM, which it never did.
     */

    for (i = 0; i < 16; i++)
    {
        cfg[i / 4] |= (uint32_t) byte[i] << ((i % 4) * 8);
    }

    umode_pmp_program(addr, cfg);
}

/****************************************************************************
 * Name: pmp_apply_all_cores
 ****************************************************************************/
static void pmp_apply_all_cores(void)
{
    int core;

    pmp_apply(NULL);

    for (core = 0; core < SOC_CPU_CORES_NUM; core++)
    {
        if (core != xPortGetCoreID())
        {
            ESP_ERROR_CHECK(esp_ipc_call_blocking(core, pmp_apply, NULL));
        }
    }
}

/****************************************************************************
 * Name: pmp_report
 *
 * Description:
 *   Decode and print all sixteen PMP entries, then name the parts of the
 *   memory map that no entry covers.
 *
 *   That last list is the interesting one and it is not obvious from the
 *   entries themselves.  PMP is default-DENY for U-mode and default-allow for
 *   M-mode: an address no entry matches is unreachable from U-mode and
 *   perfectly reachable from the kernel.  Those ranges are therefore the only
 *   memory on this board that U-mode cannot touch by hardware, which makes
 *   them the one place kernel data can be put out of a user's reach without
 *   unlocking anything -- see Documentation/isolation-limits.md.
 *
 ****************************************************************************/
static void pmp_report(void)
{
    static const struct
    {
        const char *name;
        uint32_t lo;
        uint32_t hi;
    } regions[] = {
        { "internal SRAM", SOC_IRAM_LOW, SOC_IRAM_HIGH },
        { "PSRAM window", SOC_EXTRAM_LOW, SOC_EXTRAM_HIGH },
        { "flash window", SOC_IROM_LOW, SOC_IROM_HIGH },
        { "TCM", SOC_TCM_LOW, SOC_TCM_HIGH },
        { "RTC / LP RAM", SOC_RTC_IRAM_LOW, SOC_RTC_IRAM_HIGH },
        { "peripherals", SOC_PERIPHERAL_LOW, SOC_PERIPHERAL_HIGH },
    };

    static const char *const modes[] = { "OFF", "TOR", "NA4", "NAPOT" };

    uint32_t lo[16];
    uint32_t hi[16];
    int n = 0;
    int i;
    int j;

    kprintf("KERNEL: slot table at %08lx (%u bytes) -- %s\n", (unsigned long) (uintptr_t) g_slots, (unsigned) sizeof(g_slots), ((uintptr_t) g_slots >= SOC_TCM_LOW && (uintptr_t) g_slots + sizeof(g_slots) <= SOC_TCM_HIGH) ? "in TCM, which no PMP entry covers, so U-mode cannot reach it" : "NOT in TCM; U-mode can reach it");

    kprintf("KERNEL: PMP entries:\n");

    for (i = 0; i < 16; i++)
    {
        const uint32_t cfg = (umode_read_pmpcfg(i / 4) >> ((i % 4) * 8)) & 0xff;
        const uint32_t addr = umode_read_pmpaddr(i);
        const unsigned mode = (cfg >> 3) & 3;
        uint32_t a = 0;
        uint32_t b = 0;

        if (mode == 1)                      /* TOR: [previous entry, this)  */
        {
            a = (i > 0) ? (umode_read_pmpaddr(i - 1) << 2) : 0;
            b = addr << 2;
        }
        else if (mode == 2)                 /* NA4: exactly four bytes      */
        {
            a = addr << 2;
            b = a + 4;
        }
        else if (mode == 3)                 /* NAPOT: size from trailing 1s */
        {
            const uint32_t inv = ~addr & (addr + 1);

            a = (addr & ~(inv - 1)) << 2;
            b = a + (inv << 3);
        }

        if (mode != 0 && b > a)
        {
            kprintf("KERNEL:   %2d %s %-5s %c%c%c %08lx..%08lx\n", i, (cfg & 0x80) ? "L" : "-", modes[mode], (cfg & 1) ? 'R' : '-', (cfg & 2) ? 'W' : '-', (cfg & 4) ? 'X' : '-', (unsigned long) a, (unsigned long) b);

            lo[n] = a;
            hi[n] = b;
            n++;
        }
        else
        {
            /* An entry that matches nothing: disabled, or a TOR whose base
             * and limit are the same address.
             */

            kprintf("KERNEL:   %2d %s %-5s --- matches nothing\n", i, (cfg & 0x80) ? "L" : "-", modes[mode]);
        }
    }

    /* Sort and merge the covered ranges.  Sixteen entries, so the simplest
     * sort that works is the right one.
     */

    for (i = 1; i < n; i++)
    {
        const uint32_t kl = lo[i];
        const uint32_t kh = hi[i];

