NevynUK/ESP32-P4-Protected-Mode-Sample/main/kernel_main.c
        for (j = i - 1; j >= 0 && lo[j] > kl; j--)
        {
            lo[j + 1] = lo[j];
            hi[j + 1] = hi[j];
        }

        lo[j + 1] = kl;
        hi[j + 1] = kh;
    }

    for (i = 0, j = 0; i < n; i++)
    {
        if (j > 0 && lo[i] <= hi[j - 1])
        {
            if (hi[i] > hi[j - 1])
            {
                hi[j - 1] = hi[i];
            }
        }
        else
        {
            lo[j] = lo[i];
            hi[j] = hi[i];
            j++;
        }
    }

    n = j;

    kprintf(
        "KERNEL: no PMP entry matches these, so U-mode cannot reach them at\n"
        "KERNEL:   all while the kernel still can:\n");

    for (i = 0; i < (int) (sizeof(regions) / sizeof(regions[0])); i++)
    {
        uint32_t cur = regions[i].lo;
        bool any = false;

        for (j = 0; j < n && cur < regions[i].hi; j++)
        {
            if (hi[j] <= cur || lo[j] >= regions[i].hi)
            {
                continue;
            }

            if (lo[j] > cur)
            {
                kprintf("KERNEL:   %-14s %08lx..%08lx (%lu KiB)\n", regions[i].name, (unsigned long) cur, (unsigned long) lo[j], (unsigned long) ((lo[j] - cur) / 1024));
                any = true;
            }

            if (hi[j] > cur)
            {
                cur = hi[j];
            }
        }

        if (cur < regions[i].hi)
        {
            kprintf("KERNEL:   %-14s %08lx..%08lx (%lu KiB)\n", regions[i].name, (unsigned long) cur, (unsigned long) regions[i].hi, (unsigned long) ((regions[i].hi - cur) / 1024));
            any = true;
        }

        if (!any)
        {
            kprintf("KERNEL:   %-14s -- fully covered, U-mode reaches all of it\n", regions[i].name);
        }
    }
}

/****************************************************************************
 * Name: boot_report
 *
 * Description:
 *   What the privilege and memory configuration actually is at the moment the
 *   kernel starts, printed rather than assumed.  If U-mode ever fails with an
 *   instruction access fault, this is the first thing to read.
 *
 ****************************************************************************/
static void boot_report(void)
{
    const uintptr_t iram_end = (uintptr_t) &_iram_text_end;
    const uintptr_t user_pc = (uintptr_t) user_main;
    int i;

    kprintf("\n");
    kprintf("=== ESP32-P4 protected-mode demo: M-mode kernel, U-mode user ===\n");
    kprintf("KERNEL: mstatus=%08lx mtvec=%08lx mintstatus=%08lx\n", (unsigned long) umode_read_mstatus(), (unsigned long) umode_read_mtvec(), (unsigned long) umode_read_mintstatus());
    kprintf("KERNEL: pmpcfg 0=%08lx 1=%08lx 2=%08lx 3=%08lx\n", (unsigned long) umode_read_pmpcfg(0), (unsigned long) umode_read_pmpcfg(1), (unsigned long) umode_read_pmpcfg(2), (unsigned long) umode_read_pmpcfg(3));

    pmp_report();
    kprintf(
        "KERNEL: IRAM text ends at %08lx; PMP entry 4 grants U-mode R+X "
        "below it\n",
        (unsigned long) iram_end);
    kprintf("KERNEL: user text  %08lx (%s)\n", (unsigned long) user_pc, (user_pc >= SOC_IRAM_LOW && user_pc < iram_end) ? "inside the U-mode execute grant" : "OUTSIDE the grant -- U-mode will fault on the fetch");
    kprintf("KERNEL: %d U-mode windows, NONE of them pinned, sharing that one user_main:\n", USER_SLOTS);

    for (i = 0; i < USER_SLOTS; i++)
    {
        const user_slot_t *u = &g_slots[i];
        const uintptr_t lo = (uintptr_t) u->arena;

        /* No core is printed: nothing is pinned, so where this window runs is
         * not decided yet and will not stay decided.  kernel_task reports the
         * live answer once things are running.
         */

        kprintf("KERNEL:   %s arena %08lx..%08lx (%u bytes, stack and data)\n", u->name, (unsigned long) lo, (unsigned long) (lo + u->arena_size), (unsigned) u->arena_size);
    }

    kprintf(
        "KERNEL: the arenas are separate objects and every syscall pointer is\n"
        "KERNEL:   checked against the calling user's own bounds, so no user\n"
        "KERNEL:   can reach another's memory through the kernel\n");

#if CONFIG_ESP_SYSTEM_HW_STACK_GUARD
    kprintf("KERNEL: hardware stack guard follows each window on to its own arena,\n");
    kprintf("KERNEL:   read from the assist_debug block of the core it runs on\n");
    #if SOC_CPU_CORES_NUM > 1
    kprintf(
        "KERNEL: COST: both cores are un-routed from the shared assist_debug\n"
        "KERNEL:   source, so ESP-IDF no longer panics on an M-mode stack\n"
        "KERNEL:   overflow on either core.  The monitors still latch, and each\n"
        "KERNEL:   window still reports its own user's excursions.\n");
    #endif
#else
    kprintf("KERNEL: hardware stack guard is disabled in this build\n");
#endif
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: kernel_main
 *
 * Description:
 *   The protected-mode application.  Brings up the console lock, reports the
 *   privilege configuration, and starts the two tasks.
 *
 ****************************************************************************/
void kernel_main(void)
{
    g_console_mux = xSemaphoreCreateMutex();
    configASSERT(g_console_mux != NULL);

#if CONFIG_ESP_SYSTEM_HW_STACK_GUARD && SOC_CPU_CORES_NUM > 1

    /* Take EVERY core out of the assist_debug interrupt routing.
     *
     * ETS_ASSIST_DEBUG_INTR_SOURCE is ONE source in the interrupt matrix, and
     * esp_hw_stack_guard_init() runs on every core, so each core routes it to
     * its own ETS_ASSIST_DEBUG_INUM.  A violation on one core's monitor is
     * therefore delivered to the other core as well -- where the CLIC threshold
     * that umode.S raises for its own window means nothing.  The other core
     * takes it, finds no explanation (the first core clears the latch on the way
     * out of its window) and panics the whole system with "ASSIST_DEBUG is not
     * triggered BUT interrupt occurred!".
     *
     * The peripheral offers no way to separate the two -- on this SoC
     * ASSIST_DEBUG_CORE_n_MONITOR_REG is #defined to
     * ASSIST_DEBUG_CORE_n_INTR_ENA_REG, so the monitor enable and the interrupt
     * enable are the same bits.  Un-routing the source is the only lever.
     *
     * WITH ONE WINDOW this loop skipped the window's own core, so that core kept
     * IDF's stack-guard panic for its M-mode stacks.  WITH A WINDOW ON EVERY
     * CORE there is no core left to keep it: whichever core a violation is
     * attributed to, some other core in a window has the source routed and will
     * panic on it.  So the source comes out everywhere, and the price is stated
     * plainly in the boot report -- ESP-IDF will no longer panic on an M-mode
     * stack overflow on either core.
     *
     * What is NOT lost: the monitors still run and still latch into their own
     * INTR_RAW, and each window still reads its own core's latch on the way out,
     * so a U-mode stack excursion is still caught and still attributed to the
     * user that caused it.  The residue is that a kernel-side latch on a core is
     * cleared by that core's next window entry, so an M-mode overflow there goes
     * unreported rather than merely unpanicked.
     */

