NevynUK/ESP32-P4-Protected-Mode-Sample/main/kernel_main.c
    for (int core = 0; core < SOC_CPU_CORES_NUM; core++)
    {
        esp_rom_route_intr_matrix(core, ETS_ASSIST_DEBUG_INTR_SOURCE, ETS_INVALID_INUM);
    }

#endif

    /* Describe the world to U-mode, on every core, before any window runs. */

    pmp_apply_all_cores();

    for (int i = 0; i < USER_SLOTS; i++)
    {
        snprintf(g_slot_names[i], sizeof(g_slot_names[i]), "user%d", i);

        g_slots[i].name = g_slot_names[i];
        g_slots[i].id = (uint32_t) i;

        /* Out of the on-chip user pool.  PSRAM is granted to U-mode as well
         * and there are 32 MB of it, but the arenas are what the split is
         * about, so they go in the memory the split governs.
         */

        g_slots[i].arena = user_pool_alloc(USER_ARENA_SIZE);
        g_slots[i].arena_size = USER_ARENA_SIZE;
    }

    boot_report();

    xTaskCreatePinnedToCore(kernel_task, "kernel", KERNEL_TASK_STACK, NULL, KERNEL_TASK_PRIO, NULL, tskNO_AFFINITY);

    /* One host task per slot, each pinned to its slot's core.  The task name
     * carries the slot name so the two are distinguishable in any FreeRTOS
     * introspection, and the slot is the task argument -- the host task reads
     * everything it needs from it and touches no other slot.
     */

    for (int i = 0; i < USER_SLOTS; i++)
    {
        xTaskCreatePinnedToCore(user_host_task, g_slots[i].name, USER_HOST_STACK, &g_slots[i], USER_HOST_PRIO, NULL, tskNO_AFFINITY);
    }
}

/****************************************************************************
 * Name: app_main
 *
 * Description:
 *   ESP-IDF's entry point.  It has already brought the SoC up and started the
 *   scheduler by the time this runs; the kernel proper is kernel_main().
 *
 ****************************************************************************/
void app_main(void)
{
    kernel_main();
}
